

Router>enable
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hos
Router(config)#hostname MEXICO
MEXICO(config)#in se 0/0/0
MEXICO(config-if)#ip add 8.8.8.13 255.255.255.252
MEXICO(config-if)#no sh

MEXICO(config-if)#
%LINK-5-CHANGED: Interface Serial0/0/0, changed state to up

MEXICO(config-if)#exit
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0/0, changed state to up

MEXICO(config)#in se 0/0/1
MEXICO(config-if)#ip add 8.8.8.22 255.255.255.252
MEXICO(config-if)#no sh

%LINK-5-CHANGED: Interface Serial0/0/1, changed state to down
MEXICO(config-if)#exit
MEXICO(config)#in se 0/1/0
MEXICO(config-if)#ip add 8.8.8.2 255.255.255.252
MEXICO(config-if)#no shu

%LINK-5-CHANGED: Interface Serial0/1/0, changed state to down
MEXICO(config-if)#exit
MEXICO(config)#router rip
MEXICO(config-router)#net
MEXICO(config-router)#network 8.8.8.0
MEXICO(config-router)#network 8.8.8.20
MEXICO(config-router)#network 8.8.8.12
MEXICO(config-router)#version 2
MEXICO(config-router)#no au
MEXICO(config-router)#no auto-summary 
MEXICO(config-router)#exit
MEXICO(config)#exit
MEXICO#
%SYS-5-CONFIG_I: Configured from console by console

MEXICO#copy ru
MEXICO#copy running-config star
MEXICO#copy running-config startup-config 
Destination filename [startup-config]? 
Building configuration...
[OK]
MEXICO#